---
kind: enumMember
id: F:Autodesk.Revit.DB.ScheduleFilterType.HasParameter
enum: Autodesk.Revit.DB.ScheduleFilterType
source: html/9b696f55-de40-8739-8cfb-decd51995cff.htm
---
# Autodesk.Revit.DB.ScheduleFilterType.HasParameter

The element has the parameter specified by the field. Used with shared parameters. No value is specified for this filter type.